Revit 2026 API

# ExportLineweightTableGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
```

#### Return Value

IEnumeratorKeyValuePairExportLineweightKey, ExportLineweightInfoAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ExportLineweightTable Class

Autodesk.Revit.DB Namespace